---
kind: type
id: T:Autodesk.Revit.DB.PrintRange
source: html/1f93dd2e-cf31-9990-cfa0-0100e523b843.htm
---
# Autodesk.Revit.DB.PrintRange

An enumerated type listing all Print Range types of Print.

## Syntax (C#)
```csharp
public enum PrintRange
```